
public class Lesson22 {
    public static void main(String[] args) {
        // final - этопеременная которая не может изменяться.
        //  если она получила значения, то это значение не меняется
        //  константа
    final int X = 11;
        System.out.println(X);
    }
}
class test {
    public static int CONSTANT = 10;          // не изменяемые перемененные (константы) принято писать бгльшими буквами
}

// final используется толькогда, когда нам необходима переменная,
// значение которой не будет меняться по ходу работы программы